#include "lsc.h"

/**********************************************************************
  * 函数名：cmd_action_group_run
  * 描述: 发送动作组命令
  * 参数：动作组编号   执行次数
  * 返回值:无
***********************************************************************/
void cmd_action_group_run(uint8_t action_group,uint16_t number)
{
    uint8_t command[7];
    command[0] = 0x55;
    command[1] = 0x55;
    command[2] = 0x05;
    command[3] = 0x06;
    command[4] = action_group;
    command[5] = number&0XFF;
    command[6] = (number>>8)&0XFF;
    HAL_UART_Transmit(&huart1,command,7,1000);
}

/**********************************************************************
  * 函数名：cmd_action_group_speed
  * 描述: 调节动作组执行速度
  * 参数：动作组编号   执行速度
  * 返回值:无
***********************************************************************/
void cmd_action_group_speed(uint8_t action_group,uint16_t speed)
{
    uint8_t command[7];
    command[0] = 0x55;
    command[1] = 0x55;
    command[2] = 0x05;
    command[3] = 0x0B;
    command[4] = action_group;
    command[5] = speed&0XFF;
    command[6] = (speed>>8)&0XFF;
    HAL_UART_Transmit(&huart1,command,7,1000);
}

/**********************************************************************
  * 函数名：cmd_action_group_stop
  * 描述: 发送停止命令
  * 参数：无   
  * 返回值:无
***********************************************************************/
void cmd_action_group_stop()
{
    uint8_t command[4];
    command[0] = 0x55;
    command[1] = 0x55;
    command[2] = 0x02;
    command[3] = 0x07;
    HAL_UART_Transmit(&huart1,command,4,1000);
}

/**********************************************************************
  * 函数名：servogroup_Init
  * 描述: 动作组初始化
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_Init()
{
    cmd_action_group_run(0x00,1);
}

/**********************************************************************
  * 函数名：servogroup_Init
  * 描述: 动作组初始化
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_InitInit()
{
    cmd_action_group_run(0x2C,1);
}

/**********************************************************************
  * 函数名：servogroup_Init
  * 描述: 动作组初始化
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_switch()
{
    cmd_action_group_run(0x2D,1);
}

/**********************************************************************
  * 函数名：servogroup_catch_disc_blue()
  * 描述: 蓝半场动作组升起抓圆盘机
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_catch_disc_blue()
{
    cmd_action_group_run(0x2E,1);
}

/**********************************************************************
  * 函数名：servogroup_disce_to_storehouse_blue()
  * 描述: 蓝半场动作组从圆盘机回来
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_disc_to_storehouse_blue()
{
    cmd_action_group_run(0x2F,1);
}


/**********************************************************************
  * 函数名：servogroup_catch_Stripplatform
  * 描述: 动作组抓取条形平台的球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_catch_Stripplatform()
{
    cmd_action_group_speed(0x01,150);
    cmd_action_group_run(0x01,1);
}

/**********************************************************************
  * 函数名：servogroup_Stripplatform_to_storehouse
  * 描述: 动作组将从条形平台上抓到的球放入仓库
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_Stripplatform_to_storehouse()
{
    cmd_action_group_speed(0x02,150);
    cmd_action_group_run(0x02,1);
}

/**********************************************************************
  * 函数名：servogroup_Stepped_distinguish
  * 描述: 动作组扫描识别阶梯平台
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_Stepped_distinguish()
{
    cmd_action_group_speed(0x09,175);
    cmd_action_group_run(0x09,1);
}

/**********************************************************************
  * 函数名：servogroup_catch_Steppedplatform_3
  * 描述: 动作组抓取阶梯平台高度三的球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_catch_Steppedplatform_3()
{
    cmd_action_group_speed(0x0A,120);
    cmd_action_group_run(0x0A,1);
}

/**********************************************************************
  * 函数名：servogroup_Steppedplatform_3_to_storehouse
  * 描述: 动作组把阶梯平台高度三的球放入仓库
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_Steppedplatform_3_to_storehouse()
{
    cmd_action_group_speed(0x0B,120);
    cmd_action_group_run(0x0B,1);
}

/**********************************************************************
  * 函数名：servogroup_catch_Steppedplatform_2
  * 描述: 动作组抓取阶梯平台高度二的球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_catch_Steppedplatform_2()
{
    cmd_action_group_speed(0x0C,120);
    cmd_action_group_run(0x0C,1);
}

/**********************************************************************
  * 函数名：servogroup_Steppedplatform_2_to_storehouse
  * 描述: 动作组把阶梯平台高度二的球放入仓库
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_Steppedplatform_2_to_storehouse()
{
    cmd_action_group_speed(0x0D,175);
    cmd_action_group_run(0x0D,1);
}

/**********************************************************************
  * 函数名：servogroup_catch_Steppedplatform_1
  * 描述: 动作组抓取阶梯平台高度一的球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_catch_Steppedplatform_1()
{
    cmd_action_group_speed(0x0E,120);
    cmd_action_group_run(0x0E,1);
}

/**********************************************************************
  * 函数名：servogroup_Steppedplatform_1_to_storehouse
  * 描述: 动作组把阶梯平台高度一的球放入仓库
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_Steppedplatform_1_to_storehouse()
{
    cmd_action_group_speed(0x0F,120);
    cmd_action_group_run(0x0F,1);
}

/**********************************************************************
  * 函数名：servogroup_catch_storehouse
  * 描述: 动作组抓取转盘仓库的小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_catch_storehouse()
{
    cmd_action_group_speed(0x10,120);
    cmd_action_group_run(0x10,1);
}

/**********************************************************************
  * 函数名：servogroup_storehouse_to_floor_1
  * 描述: 动作组将转盘仓库小球放到立体仓库第一行
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_storehouse_to_floor_1()
{
    cmd_action_group_speed(0x11,120);
    cmd_action_group_run(0x11,1);
}

/**********************************************************************
  * 函数名：servogroup_floor_1_to_storehouse
  * 描述: 动作组从立体仓库第一行降下
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_floor_1_to_storehouse()
{
    cmd_action_group_speed(0x12,120);
    cmd_action_group_run(0x12,1);
}

/**********************************************************************
  * 函数名：servogroup_storehouse_to_floor_2
  * 描述: 动作组将转盘仓库小球放到立体仓库第二行
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_storehouse_to_floor_2()
{
    cmd_action_group_speed(0x13,120);
    cmd_action_group_run(0x13,1);
}

/**********************************************************************
  * 函数名：servogroup_floor_2_to_storehouse
  * 描述: 动作组从立体仓库第二行降下
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_floor_2_to_storehouse()
{
    cmd_action_group_speed(0x14,120);
    cmd_action_group_run(0x14,1);
}

/**********************************************************************
  * 函数名：servogroup_storehouse_to_floor_3
  * 描述: 动作组将转盘仓库小球放到立体仓库第三行
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_storehouse_to_floor_3()
{
    cmd_action_group_speed(0x15,120);
    cmd_action_group_run(0x15,1);
}

/**********************************************************************
  * 函数名：servogroup_floor_3_to_storehouse
  * 描述: 动作组从立体仓库第三行降下
  * 参数：无   
  * 返回值:无
***********************************************************************/
void servogroup_floor_3_to_storehouse()
{
    cmd_action_group_speed(0x16,120);
    cmd_action_group_run(0x16,1);
}

/**********************************************************************
  * 函数名：stack_transfer_distinguish_3
  * 描述: 动作组进行倒垛第三行的识别
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_distinguish_3()
{
    cmd_action_group_run(0x03,1);  
}

/**********************************************************************
  * 函数名：stack_transfer_distinguish_2
  * 描述: 动作组进行倒垛第二行的识别
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_distinguish_2()
{
    cmd_action_group_run(0x05,1);  
}

/**********************************************************************
  * 函数名：stack_transfer_distinguish_1
  * 描述: 动作组进行倒垛第一行的识别
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_distinguish_1()
{
    cmd_action_group_run(0x07,1);  
}

/**********************************************************************
  * 函数名：stack_transfer_catch_3
  * 描述: 动作组进行倒垛第三行的抓取
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_catch_3()
{
    cmd_action_group_run(0x04,1);
}

/**********************************************************************
  * 函数名：stack_transfer_catch_2
  * 描述: 动作组进行倒垛第二行的抓取
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_catch_2()
{
    cmd_action_group_run(0x06,1);
}

/**********************************************************************
  * 函数名：stack_transfer_catch_1
  * 描述: 动作组进行倒垛第一行的抓取
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_catch_1()
{
    cmd_action_group_run(0x08,1);
}

/**********************************************************************
  * 函数名：stack_transfer_back_1
  * 描述: 动作组进行倒垛第一行抓取完成后的撤出
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_back_1()
{
    cmd_action_group_run(0x26,1);
}

/**********************************************************************
  * 函数名：stack_transfer_put_1
  * 描述: 动作组进行倒垛第一行的放置
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_put_1()
{
    cmd_action_group_run(0x27,1);
}

/**********************************************************************
  * 函数名：stack_transfer_back_2
  * 描述: 动作组进行倒垛第二行抓取完成后的撤出
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_back_2()
{
    cmd_action_group_run(0x28,1);
}

/**********************************************************************
  * 函数名：stack_transfer_put_2
  * 描述: 动作组进行倒垛第二行的放置
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_put_2()
{
    cmd_action_group_run(0x29,1);
}

/**********************************************************************
  * 函数名：stack_transfer_back_3
  * 描述: 动作组进行倒垛第三行抓取完成后的撤出
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_back_3()
{
    cmd_action_group_run(0x2A,1);
}

/**********************************************************************
  * 函数名：stack_transfer_put_3
  * 描述: 动作组进行倒垛第三行的放置
  * 参数：无   
  * 返回值:无
***********************************************************************/
void stack_transfer_put_3()
{
    cmd_action_group_run(0x2B,1);
}

/**********************************************************************
  * 函数名：sdistinguish_staketask()
  * 描述: 机械臂升起识别立桩
  * 参数：无   
  * 返回值:无
***********************************************************************/
void distinguish_staketask()
{
    cmd_action_group_run(0x17,1);
}

/**********************************************************************
  * 函数名：catch_staketask_A
  * 描述: 抓取A区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void catch_staketask_A()
{
    cmd_action_group_run(0x18,1);
}

/**********************************************************************
  * 函数名：catch_staketask_B
  * 描述: 抓取B区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void catch_staketask_B()
{
    cmd_action_group_run(0x19,1);
}

/**********************************************************************
  * 函数名：put_staketask_A
  * 描述:放置A区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void put_staketask_A()
{
    cmd_action_group_run(0x1A,1);
}

/**********************************************************************
  * 函数名：put_staketask_B
  * 描述:放置B区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void put_staketask_B()
{
    cmd_action_group_run(0x1B,1);
}

/**********************************************************************
  * 函数名：catch_staketask_C
  * 描述:抓取C区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void catch_staketask_C()
{
    cmd_action_group_run(0x1C,1);
}

/**********************************************************************
  * 函数名：put_staketask_C
  * 描述:放置C区小球
  * 参数：无  
  * 返回值:无
***********************************************************************/
void put_staketask_C()
{
    cmd_action_group_run(0x1D,1);
}

/**********************************************************************
  * 函数名：catch_staketask_D
  * 描述:抓取D区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void catch_staketask_D()
{
    cmd_action_group_run(0x1E,1);
}

/**********************************************************************
  * 函数名：put_staketask_D
  * 描述:放置D区小球
  * 参数：无  
  * 返回值:无
***********************************************************************/
void put_staketask_D()
{
    cmd_action_group_run(0x1F,1);
}

/**********************************************************************
  * 函数名：catch_staketask_E
  * 描述:抓取E区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void catch_staketask_E()
{
    cmd_action_group_run(0x20,1);
}

/**********************************************************************
  * 函数名：put_staketask_E
  * 描述:放置E区小球
  * 参数：无  
  * 返回值:无
***********************************************************************/
void put_staketask_E()
{
    cmd_action_group_run(0x21,1);
}

/**********************************************************************
  * 函数名：catch_staketask_F
  * 描述:抓取F区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void catch_staketask_F()
{
    cmd_action_group_run(0x22,1);
}

/**********************************************************************
  * 函数名：put_staketask_F
  * 描述:放置F区小球
  * 参数：无  
  * 返回值:无
***********************************************************************/
void put_staketask_F()
{
    cmd_action_group_run(0x23,1);
}

/**********************************************************************
  * 函数名：catch_staketask_G
  * 描述:抓取G区小球
  * 参数：无   
  * 返回值:无
***********************************************************************/
void catch_staketask_G()
{
    cmd_action_group_run(0x24,1);
}

/**********************************************************************
  * 函数名：put_staketask_G
  * 描述:放置G区小球
  * 参数：无  
  * 返回值:无
***********************************************************************/
void put_staketask_G()
{
    cmd_action_group_run(0x25,1);
}
